%% 全自由度stap
clc;clear;close all
%% 天基平台参数设置%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
fo = 450e6; %450e6   9600e6                 %载频 Hz
C = 299792458;                            %光速 m/s
lambda = C/fo;                      %波长 m
Nr = 16;                             %接收阵元个数
Nt = 4;                              %发射阵元个数
Np = 16;                             %相干脉冲数
D = Nt*Nr*Np;                          %自由度 
Re = 6373e3;                          %地球半径m
H = 700e3;  %700e3  %9e3                 %SBR高度 m
Vp = 50;
if H >=500e3
    Vp = fun_Vp(H);                      %SBR速度m/s
end                
d = 60;%                           %归一化阵元间距
gamma = 16;                         %发射接收空间比率
PRF = 400;                         %脉冲重复频率Hz，500~2000
Tr =1/PRF;                         %脉冲重复间隔s
% beta = 19.47;
beta = Vp*2/PRF/(d*lambda/2);      %%混叠系数 
alpha1 = 20/180*pi;                  %卫星纬度
eta = 90/180*pi;                    %卫星倾角
%% 距离
Rs = 130d3;
if H>=500e3
    R = 1301e3;                               %地距m
    Rs = fun_R2Rs(H, R);
end
